# Tarea Clase 12 - SQL in Python II
## Héctor Gabriel Sánchez Pérez

Este repositorio se encuentra en GitHub en:

https://github.com/cfocoder/tarea_clase_14_programacion_1

- Aplicar cada una de las funciones de la Clase 11, en la información contenida en la base de datos que creaste en la tarea de la Clase número 11
- Investigar cual sería el Driver a utilizar para conectarnos a MySQL

In [1]:
import sqlite3
import pandas as pd
from pathlib import Path

# Conexión a la base de datos SQLite
db_path = Path("DB_Propia.db")
conexion = sqlite3.connect(str(db_path))

print("✓ Conexión a DB_Propia.db exitosa")

✓ Conexión a DB_Propia.db exitosa

## 1. SELECT - Obtener todos los registros

In [2]:
query_select_empleados = "SELECT * FROM empleados"
df_empleados = pd.read_sql(query_select_empleados, conexion)
df_empleados

   id_empleado           nombre  edad      departamento  salario
0            1       Juan Pérez    28            Ventas    35000
1            2     María García    35                IT    50000
2            3     Carlos López    42  Recursos Humanos    40000
3            4     Ana Martínez    31          Finanzas    45000
4            5    Roberto Silva    29            Ventas    38000
5            6  Laura Fernández    38                IT    52000
6            7  Diego Rodríguez    45          Gerencia    60000
7            8   Sofía González    26         Marketing    32000
8            9   Miguel Ramírez    33       Operaciones    42000
9           10     Elena Torres    40  Recursos Humanos    41000

In [3]:
query_select_proyectos = "SELECT * FROM proyectos"
df_proyectos = pd.read_sql(query_select_proyectos, conexion)
df_proyectos

,id_proyecto,nombre_proyecto,presupuesto,duracion_meses,estado
0,101,Sistema de Facturación,100000,6,Completado
1,102,App Móvil Ventas,150000,8,En Progreso
2,103,Base de Datos Centralizada,80000,4,Completado
3,104,Sitio Web Corporativo,50000,3,Completado
4,105,Sistema CRM,200000,10,En Progreso
5,106,Automatización Procesos,75000,5,Cancelado
6,107,Portal de Análisis,120000,7,En Progreso
7,108,Capacitación Personal,25000,2,Completado
8,109,Infraestructura Cloud,180000,6,En Progreso
9,110,Seguridad Información,95000,4,Completado

In [4]:
query_select_clientes = "SELECT * FROM clientes"
df_clientes = pd.read_sql(query_select_clientes, conexion)
df_clientes

,id_cliente,nombre_cliente,ciudad,telefono,email
0,1001,Empresa ABC Solutions,Madrid,912345678,contacto@abc.com
1,1002,Tech Global Industries,Barcelona,934567890,info@techglobal.com
2,1003,Retail Express España,Valencia,963456789,ventas@retailexpress.es
3,1004,Construcciones Premium,Bilbao,944567890,obras@construpremi.es
4,1005,Consultoría Ejecutiva,Madrid,915678901,consulta@ejecutiva.es
5,1006,Distribuciones Del Sur,Sevilla,954567890,dist@delsur.com
6,1007,Logística Internacional,Barcelona,932345678,logistica@intl.es
7,1008,Farmacéutica Moderna,Madrid,918765432,pharma@moderna.es
8,1009,Alimentos Naturales SA,Murcia,968456789,natural@alimentos.com
9,1010,Energía Renovable Plus,Barcelona,933456789,energy@renewable.es

## 2. WHERE - Filtrar registros con condiciones

In [5]:
# Empleados con salario mayor a 50000
query_where_salario = "SELECT nombre, departamento, salario FROM empleados WHERE salario > 50000"
df_salario_alto = pd.read_sql(query_where_salario, conexion)
print("Empleados con salario > 50000:")
df_salario_alto

Empleados con salario > 50000:

            nombre departamento  salario
0  Laura Fernández           IT    52000
1  Diego Rodríguez     Gerencia    60000

In [6]:
# Clientes de una ciudad específica
query_where_ciudad = "SELECT nombre_cliente, ciudad, email FROM clientes WHERE ciudad = 'Madrid'"
df_clientes_madrid = pd.read_sql(query_where_ciudad, conexion)
print("Clientes en Madrid:")
df_clientes_madrid

Clientes en Madrid:

          nombre_cliente  ciudad                  email
0  Empresa ABC Solutions  Madrid       contacto@abc.com
1  Consultoría Ejecutiva  Madrid  consulta@ejecutiva.es
2   Farmacéutica Moderna  Madrid      pharma@moderna.es

## 3. ORDER BY - Ordenar resultados

In [7]:
# Empleados ordenados por salario descendente
query_order_by_salario = "SELECT nombre, departamento, salario FROM empleados ORDER BY salario DESC"
df_empleados_ordenados = pd.read_sql(query_order_by_salario, conexion)
print("Empleados ordenados por salario (Mayor a Menor):")
df_empleados_ordenados

Empleados ordenados por salario (Mayor a Menor):

            nombre      departamento  salario
0  Diego Rodríguez          Gerencia    60000
1  Laura Fernández                IT    52000
2     María García                IT    50000
3     Ana Martínez          Finanzas    45000
4   Miguel Ramírez       Operaciones    42000
5     Elena Torres  Recursos Humanos    41000
6     Carlos López  Recursos Humanos    40000
7    Roberto Silva            Ventas    38000
8       Juan Pérez            Ventas    35000
9   Sofía González         Marketing    32000

In [8]:
# Proyectos ordenados por presupuesto ascendente
query_order_by_presupuesto = "SELECT nombre_proyecto, presupuesto, duracion_meses FROM proyectos ORDER BY presupuesto ASC"
df_proyectos_ordenados = pd.read_sql(query_order_by_presupuesto, conexion)
print("Proyectos ordenados por presupuesto (Menor a Mayor):")
df_proyectos_ordenados

Proyectos ordenados por presupuesto (Menor a Mayor):

              nombre_proyecto  presupuesto  duracion_meses
0       Capacitación Personal        25000               2
1       Sitio Web Corporativo        50000               3
2     Automatización Procesos        75000               5
3  Base de Datos Centralizada        80000               4
4       Seguridad Información        95000               4
5      Sistema de Facturación       100000               6
6          Portal de Análisis       120000               7
7            App Móvil Ventas       150000               8
8       Infraestructura Cloud       180000               6
9                 Sistema CRM       200000              10

## 4. AGGREGATE FUNCTIONS - COUNT, SUM, AVG, MIN, MAX

In [9]:
# COUNT - Contar el total de empleados
query_count = "SELECT COUNT(*) as total_empleados FROM empleados"
df_count = pd.read_sql(query_count, conexion)
print("Total de empleados:")
df_count

Total de empleados:

   total_empleados
0               10

In [10]:
# SUM - Suma total de presupuestos
query_sum = "SELECT SUM(presupuesto) as presupuesto_total FROM proyectos"
df_sum = pd.read_sql(query_sum, conexion)
print("Presupuesto total de todos los proyectos:")
df_sum

Presupuesto total de todos los proyectos:

   presupuesto_total
0            1075000

In [11]:
# AVG - Promedio de salarios
query_avg = "SELECT AVG(salario) as salario_promedio FROM empleados"
df_avg = pd.read_sql(query_avg, conexion)
print("Salario promedio:")
df_avg

Salario promedio:

   salario_promedio
0           43500.0

In [12]:
# MIN - Salario mínimo
query_min = "SELECT MIN(salario) as salario_minimo FROM empleados"
df_min = pd.read_sql(query_min, conexion)
print("Salario mínimo:")
df_min

Salario mínimo:

   salario_minimo
0           32000

In [13]:
# MAX - Salario máximo
query_max = "SELECT MAX(salario) as salario_maximo FROM empleados"
df_max = pd.read_sql(query_max, conexion)
print("Salario máximo:")
df_max

Salario máximo:

   salario_maximo
0           60000

## 5. GROUP BY - Agrupar datos

In [14]:
# GROUP BY - Agrupar empleados por departamento y calcular promedio de salario
query_group_by = """
SELECT departamento, COUNT(*) as cantidad_empleados, AVG(salario) as salario_promedio 
FROM empleados 
GROUP BY departamento
"""
df_group_by = pd.read_sql(query_group_by, conexion)
print("Empleados agrupados por departamento:")
df_group_by

Empleados agrupados por departamento:

       departamento  cantidad_empleados  salario_promedio
0          Finanzas                   1           45000.0
1          Gerencia                   1           60000.0
2                IT                   2           51000.0
3         Marketing                   1           32000.0
4       Operaciones                   1           42000.0
5  Recursos Humanos                   2           40500.0
6            Ventas                   2           36500.0

In [15]:
# GROUP BY - Proyectos agrupados por estado
query_group_by_estado = """
SELECT estado, COUNT(*) as cantidad_proyectos, SUM(presupuesto) as presupuesto_total 
FROM proyectos 
GROUP BY estado
"""
df_group_by_estado = pd.read_sql(query_group_by_estado, conexion)
print("Proyectos agrupados por estado:")
df_group_by_estado

Proyectos agrupados por estado:

        estado  cantidad_proyectos  presupuesto_total
0    Cancelado                   1              75000
1   Completado                   5             350000
2  En Progreso                   4             650000

## 6. HAVING - Filtrar grupos

In [16]:
# HAVING - Departamentos con salario promedio mayor a 55000
query_having = """
SELECT departamento, COUNT(*) as cantidad_empleados, AVG(salario) as salario_promedio 
FROM empleados 
GROUP BY departamento
HAVING AVG(salario) > 55000
"""
df_having = pd.read_sql(query_having, conexion)
print("Departamentos con salario promedio > 55000:")
df_having

Departamentos con salario promedio > 55000:

  departamento  cantidad_empleados  salario_promedio
0     Gerencia                   1           60000.0

## 7. Análisis de la tabla Maratón NY - SELECT

In [17]:
# Obtener primeros 10 corredores de la tabla maratón_ny
query_maraton_select = "SELECT * FROM maraton_ny LIMIT 10"
df_maraton_sample = pd.read_sql(query_maraton_select, conexion)
print("Primeros 10 corredores de la Maratón NY:")
df_maraton_sample

Primeros 10 corredores de la Maratón NY:

   corredor  lugar  genero  edad pais_origen  tiempo_minutos
0      3475   3592    Male    52         GBR      217.483333
1     13594  13853  Female    40          NY      272.550000
2     12012  12256    Male    31         FRA      265.283333
3     10236  10457  Female    33          MI      256.150000
4      9476   9686    Male    33          NY      252.250000
5      1720   1784    Male    40          NJ      201.966667
6     15736  16020  Female    30          CA      283.566667
7     10580  10805    Male    27         GBR      255.883333
8     11957  12201    Male    42         NED      264.250000
9     18933  19266    Male    48         B.C      306.683333

## 8. Maratón NY - WHERE (Filtrar por genero y tiempo)

In [18]:
# Corredores de género femenino
query_maraton_where_genero = "SELECT corredor, lugar, genero, edad, pais_origen, tiempo_minutos FROM maraton_ny WHERE genero = 'F' LIMIT 10"
df_maraton_mujeres = pd.read_sql(query_maraton_where_genero, conexion)
print("Corredoras de género femenino (primeras 10):")
df_maraton_mujeres

Corredoras de género femenino (primeras 10):

Empty DataFrame
Columns: [corredor, lugar, genero, edad, pais_origen, tiempo_minutos]
Index: []

In [19]:
# Corredores con tiempo menor a 300 minutos
query_maraton_tiempo = "SELECT corredor, lugar, genero, edad, pais_origen, tiempo_minutos FROM maraton_ny WHERE tiempo_minutos < 300 LIMIT 10"
df_maraton_rapidos = pd.read_sql(query_maraton_tiempo, conexion)
print("Corredores con tiempo < 300 minutos (primeros 10):")
df_maraton_rapidos

Corredores con tiempo < 300 minutos (primeros 10):

   corredor  lugar  genero  edad pais_origen  tiempo_minutos
0      3475   3592    Male    52         GBR      217.483333
1     13594  13853  Female    40          NY      272.550000
2     12012  12256    Male    31         FRA      265.283333
3     10236  10457  Female    33          MI      256.150000
4      9476   9686    Male    33          NY      252.250000
5      1720   1784    Male    40          NJ      201.966667
6     15736  16020  Female    30          CA      283.566667
7     10580  10805    Male    27         GBR      255.883333
8     11957  12201    Male    42         NED      264.250000
9     14956  15229  Female    63         GBR      281.266667

## 9. Maratón NY - ORDER BY (Ordenar corredores)

In [20]:
# Top 10 corredores más rápidos (menor tiempo)
query_maraton_order_tiempo = "SELECT corredor, lugar, genero, edad, tiempo_minutos FROM maraton_ny ORDER BY tiempo_minutos ASC LIMIT 10"
df_top_rapidos = pd.read_sql(query_maraton_order_tiempo, conexion)
print("Top 10 corredores más rápidos:")
df_top_rapidos

Top 10 corredores más rápidos:

   corredor  lugar genero  edad  tiempo_minutos
0        53     54   Male    37      147.333333
1       100    104   Male    27      156.000000
2       112    116   Male    43      157.583333
3       191    200   Male    40      163.933333
4       204    213   Male    35      164.500000
5       218    228   Male    33      165.516667
6       253    265   Male    29      168.183333
7       286    298   Male    33      169.666667
8       317    329   Male    34      171.283333
9       323    335   Male    32      171.566667

In [21]:
# Top 10 corredores más lentos (mayor tiempo)
query_maraton_order_lento = "SELECT corredor, lugar, genero, edad, tiempo_minutos FROM maraton_ny ORDER BY tiempo_minutos DESC LIMIT 10"
df_top_lentos = pd.read_sql(query_maraton_order_lento, conexion)
print("Top 10 corredores más lentos:")
df_top_lentos

Top 10 corredores más lentos:

   corredor  lugar  genero  edad  tiempo_minutos
0     23290  23662  Female    69      566.783333
1     23282  23654    Male    69      508.083333
2     23273  23645  Female    46      501.550000
3     23269  23641    Male    40      491.566667
4     23255  23627    Male    45      478.016667
5     23250  23622    Male    33      475.366667
6     23231  23603  Female    58      467.183333
7     23230  23602    Male    73      460.800000
8     23221  23593    Male    51      454.650000
9     23162  23533    Male    70      440.766667

## 10. Maratón NY - AGGREGATE FUNCTIONS

In [22]:
# Total de corredores en la maratón
query_maraton_count = "SELECT COUNT(*) as total_corredores FROM maraton_ny"
df_maraton_count = pd.read_sql(query_maraton_count, conexion)
print("Total de corredores:")
df_maraton_count

Total de corredores:

   total_corredores
0              1000

In [23]:
# Tiempo promedio de la maratón
query_maraton_avg = "SELECT AVG(tiempo_minutos) as tiempo_promedio FROM maraton_ny"
df_maraton_avg = pd.read_sql(query_maraton_avg, conexion)
print("Tiempo promedio (en minutos):")
df_maraton_avg

Tiempo promedio (en minutos):

   tiempo_promedio
0         268.5707

In [24]:
# Tiempo mínimo y máximo
query_maraton_minmax = "SELECT MIN(tiempo_minutos) as tiempo_minimo, MAX(tiempo_minutos) as tiempo_maximo FROM maraton_ny"
df_maraton_minmax = pd.read_sql(query_maraton_minmax, conexion)
print("Tiempo mínimo y máximo (en minutos):")
df_maraton_minmax

Tiempo mínimo y máximo (en minutos):

   tiempo_minimo  tiempo_maximo
0     147.333333     566.783333

## 11. Maratón NY - GROUP BY (Agrupar por género y país)

In [25]:
# Agrupar por género y calcular estadísticas
query_maraton_group_genero = """
SELECT genero, 
       COUNT(*) as cantidad_corredores,
       AVG(edad) as edad_promedio,
       AVG(tiempo_minutos) as tiempo_promedio
FROM maraton_ny 
GROUP BY genero
"""
df_maraton_por_genero = pd.read_sql(query_maraton_group_genero, conexion)
print("Corredores agrupados por género:")
df_maraton_por_genero

Corredores agrupados por género:

   genero  cantidad_corredores  edad_promedio  tiempo_promedio
0  Female                  292      35.472603       284.936644
1    Male                  708      40.596045       261.820904

In [26]:
# Agrupar por país de origen
query_maraton_group_pais = """
SELECT pais_origen, 
       COUNT(*) as cantidad_corredores,
       AVG(tiempo_minutos) as tiempo_promedio
FROM maraton_ny 
GROUP BY pais_origen
ORDER BY cantidad_corredores DESC
LIMIT 10
"""
df_maraton_por_pais = pd.read_sql(query_maraton_group_pais, conexion)
print("Top 10 países con más corredores:")
df_maraton_por_pais

Top 10 países con más corredores:

  pais_origen  cantidad_corredores  tiempo_promedio
0          NY                  284       274.501878
1         GBR                   87       280.826820
2         FRA                   71       249.196948
3          NJ                   61       269.677596
4         ITA                   52       261.372115
5          CA                   40       280.155417
6         NED                   39       261.137607
7         GER                   28       260.305952
8          MA                   26       251.223718
9          CT                   20       276.121667

## 12. Maratón NY - HAVING (Filtrar grupos)

In [27]:
# Países con tiempo promedio menor a 350 minutos
query_maraton_having = """
SELECT pais_origen, 
       COUNT(*) as cantidad_corredores,
       AVG(tiempo_minutos) as tiempo_promedio
FROM maraton_ny 
GROUP BY pais_origen
HAVING AVG(tiempo_minutos) < 350
ORDER BY tiempo_promedio ASC
"""
df_maraton_having = pd.read_sql(query_maraton_having, conexion)
print("Países con tiempo promedio < 350 minutos:")
df_maraton_having

Países con tiempo promedio < 350 minutos:

   pais_origen  cantidad_corredores  tiempo_promedio
0           AK                    1       147.333333
1          PAR                    1       180.750000
2          CHI                    2       209.408333
3          NZL                    2       214.541667
4          ESP                    6       216.452778
..         ...                  ...              ...
66          MO                    4       316.091667
67          NM                    2       323.233333
68         KOR                    1       327.166667
69          SD                    1       339.050000
70          LA                    3       348.538889

[71 rows x 3 columns]

## 13. Cierre de conexión

In [28]:
# Cerrar la conexión con la base de datos
conexion.close()
print("✓ Conexión cerrada exitosamente")

✓ Conexión cerrada exitosamente

## 14. Drivers para Conectarse a Diferentes Bases de Datos

### Drivers disponibles para diferentes bases de datos:

**Para MySQL:**
- **mysql-connector-python**: Driver oficial de MySQL
- **PyMySQL**: Driver puro de Python (sin dependencias externas)
- **mysqlclient** (MySQLdb): Wrapper de libmysqlclient (más rápido pero requiere librerías del sistema)

**Para PostgreSQL:**
- **psycopg2**: Driver más popular y recomendado
- **psycopg3**: Versión más nueva y moderna

**Para SQL Server:**
- **pyodbc**: Driver genérico ODBC (también funciona con MySQL)
- **pymssql**: Driver específico para SQL Server

**Para SQLite (usado en esta tarea):**
- **sqlite3**: Integrado en Python por defecto

**Para Oracle:**
- **cx_Oracle**: Driver oficial de Oracle

**Para otras bases de datos:**
- **psycopg2**: PostgreSQL
- **pymongo**: MongoDB
- **cassandra-driver**: Apache Cassandra